cf_billing/Documents/бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестУчастиеОбъектовВРаспределенииРесурсовВМКД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участвует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестУчастиеОбъектовВРаспределенииРесурсовВМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУчастиеОбъектовВРаспределенииРесурсовВМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Участвует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД(ЭтотОбъект, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	Объект.ОбъектРасчета = Неопределено;
	Объект.Район = Неопределено;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) ТОгда
		ЗаполнитьСостояниеОР();
	КонецЕсли;
	ЗаполнитьАдрессОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Район) Тогда 
		Объект.ОбъектРасчета = Неопределено;
		Объект.Район = Неопределено;
	Иначе 
		Объект.Организация = Объект.Район.Организация;
		Объект.ОбъектРасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояниеОР()
	Запрос = Новый  Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних.Участвует КАК ПредыдущееСостояние
	               |ИЗ
	               |	РегистрСведений.бестУчастиеОбъектовВРаспределенииРесурсовВМКД.СрезПоследних(&Период, ОбъектРасчета = &ОбъектРасчета) КАК бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних";
	Запрос.УстановитьПараметр("период", Объект.Дата);
	Запрос.УстановитьПараметр("ОбъектРасчета", Объект.ОбъектРасчета);
	
	Результат = запрос.Выполнить();
	выборка = Результат.Выбрать();
	
	Пока выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти
